node {
  name: "weights_and_biases/random_normal/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "-\000\000\000\030\000\000\000"
      }
    }
  }
}
node {
  name: "weights_and_biases/random_normal/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "weights_and_biases/random_normal/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "weights_and_biases/random_normal/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "weights_and_biases/random_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "weights_and_biases/random_normal/mul"
  op: "Mul"
  input: "weights_and_biases/random_normal/RandomStandardNormal"
  input: "weights_and_biases/random_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "weights_and_biases/random_normal"
  op: "Add"
  input: "weights_and_biases/random_normal/mul"
  input: "weights_and_biases/random_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "weights_and_biases/insertion_weight"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 45
        }
        dim {
          size: 24
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "weights_and_biases/insertion_weight/Assign"
  op: "Assign"
  input: "weights_and_biases/insertion_weight"
  input: "weights_and_biases/random_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@weights_and_biases/insertion_weight"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "weights_and_biases/insertion_weight/read"
  op: "Identity"
  input: "weights_and_biases/insertion_weight"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@weights_and_biases/insertion_weight"
      }
    }
  }
}
node {
  name: "weights_and_biases/random_normal_1/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "-\000\000\000\030\000\000\000"
      }
    }
  }
}
node {
  name: "weights_and_biases/random_normal_1/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "weights_and_biases/random_normal_1/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "weights_and_biases/random_normal_1/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "weights_and_biases/random_normal_1/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "weights_and_biases/random_normal_1/mul"
  op: "Mul"
  input: "weights_and_biases/random_normal_1/RandomStandardNormal"
  input: "weights_and_biases/random_normal_1/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "weights_and_biases/random_normal_1"
  op: "Add"
  input: "weights_and_biases/random_normal_1/mul"
  input: "weights_and_biases/random_normal_1/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "weights_and_biases/Input_Forget_weight"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 45
        }
        dim {
          size: 24
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "weights_and_biases/Input_Forget_weight/Assign"
  op: "Assign"
  input: "weights_and_biases/Input_Forget_weight"
  input: "weights_and_biases/random_normal_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@weights_and_biases/Input_Forget_weight"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "weights_and_biases/Input_Forget_weight/read"
  op: "Identity"
  input: "weights_and_biases/Input_Forget_weight"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@weights_and_biases/Input_Forget_weight"
      }
    }
  }
}
node {
  name: "weights_and_biases/random_normal_2/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "-\000\000\000\030\000\000\000"
      }
    }
  }
}
node {
  name: "weights_and_biases/random_normal_2/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "weights_and_biases/random_normal_2/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "weights_and_biases/random_normal_2/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "weights_and_biases/random_normal_2/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "weights_and_biases/random_normal_2/mul"
  op: "Mul"
  input: "weights_and_biases/random_normal_2/RandomStandardNormal"
  input: "weights_and_biases/random_normal_2/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "weights_and_biases/random_normal_2"
  op: "Add"
  input: "weights_and_biases/random_normal_2/mul"
  input: "weights_and_biases/random_normal_2/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "weights_and_biases/Suggestion_weight"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 45
        }
        dim {
          size: 24
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "weights_and_biases/Suggestion_weight/Assign"
  op: "Assign"
  input: "weights_and_biases/Suggestion_weight"
  input: "weights_and_biases/random_normal_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@weights_and_biases/Suggestion_weight"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "weights_and_biases/Suggestion_weight/read"
  op: "Identity"
  input: "weights_and_biases/Suggestion_weight"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@weights_and_biases/Suggestion_weight"
      }
    }
  }
}
node {
  name: "weights_and_biases/random_normal_3/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\030\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "weights_and_biases/random_normal_3/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "weights_and_biases/random_normal_3/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "weights_and_biases/random_normal_3/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "weights_and_biases/random_normal_3/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "weights_and_biases/random_normal_3/mul"
  op: "Mul"
  input: "weights_and_biases/random_normal_3/RandomStandardNormal"
  input: "weights_and_biases/random_normal_3/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "weights_and_biases/random_normal_3"
  op: "Add"
  input: "weights_and_biases/random_normal_3/mul"
  input: "weights_and_biases/random_normal_3/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "weights_and_biases/outwards_propagating_weight"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 24
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "weights_and_biases/outwards_propagating_weight/Assign"
  op: "Assign"
  input: "weights_and_biases/outwards_propagating_weight"
  input: "weights_and_biases/random_normal_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@weights_and_biases/outwards_propagating_weight"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "weights_and_biases/outwards_propagating_weight/read"
  op: "Identity"
  input: "weights_and_biases/outwards_propagating_weight"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@weights_and_biases/outwards_propagating_weight"
      }
    }
  }
}
node {
  name: "weights_and_biases/zeros"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 24
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "weights_and_biases/insertion_bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 24
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "weights_and_biases/insertion_bias/Assign"
  op: "Assign"
  input: "weights_and_biases/insertion_bias"
  input: "weights_and_biases/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@weights_and_biases/insertion_bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "weights_and_biases/insertion_bias/read"
  op: "Identity"
  input: "weights_and_biases/insertion_bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@weights_and_biases/insertion_bias"
      }
    }
  }
}
node {
  name: "weights_and_biases/zeros_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 24
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "weights_and_biases/input_forget_bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 24
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "weights_and_biases/input_forget_bias/Assign"
  op: "Assign"
  input: "weights_and_biases/input_forget_bias"
  input: "weights_and_biases/zeros_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@weights_and_biases/input_forget_bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "weights_and_biases/input_forget_bias/read"
  op: "Identity"
  input: "weights_and_biases/input_forget_bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@weights_and_biases/input_forget_bias"
      }
    }
  }
}
node {
  name: "weights_and_biases/zeros_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 24
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "weights_and_biases/suggestion_bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 24
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "weights_and_biases/suggestion_bias/Assign"
  op: "Assign"
  input: "weights_and_biases/suggestion_bias"
  input: "weights_and_biases/zeros_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@weights_and_biases/suggestion_bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "weights_and_biases/suggestion_bias/read"
  op: "Identity"
  input: "weights_and_biases/suggestion_bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@weights_and_biases/suggestion_bias"
      }
    }
  }
}
node {
  name: "weights_and_biases/zeros_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 1
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "weights_and_biases/outwards_propagating_bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "weights_and_biases/outwards_propagating_bias/Assign"
  op: "Assign"
  input: "weights_and_biases/outwards_propagating_bias"
  input: "weights_and_biases/zeros_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@weights_and_biases/outwards_propagating_bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "weights_and_biases/outwards_propagating_bias/read"
  op: "Identity"
  input: "weights_and_biases/outwards_propagating_bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@weights_and_biases/outwards_propagating_bias"
      }
    }
  }
}
node {
  name: "placeholders/label"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "placeholders/initial_states"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 24
        }
      }
    }
  }
}
node {
  name: "placeholders/input_data"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 17
        }
        dim {
          size: 1
        }
        dim {
          size: 21
        }
      }
    }
  }
}
node {
  name: "forward_roll/scan/TensorArray/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 17
      }
    }
  }
}
node {
  name: "forward_roll/scan/TensorArray"
  op: "TensorArrayV3"
  input: "forward_roll/scan/TensorArray/size"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
  attr {
    key: "identical_element_shapes"
    value {
      b: true
    }
  }
  attr {
    key: "tensor_array_name"
    value {
      s: ""
    }
  }
}
node {
  name: "forward_roll/scan/TensorArrayUnstack/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\021\000\000\000\001\000\000\000\025\000\000\000"
      }
    }
  }
}
node {
  name: "forward_roll/scan/TensorArrayUnstack/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "forward_roll/scan/TensorArrayUnstack/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "forward_roll/scan/TensorArrayUnstack/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "forward_roll/scan/TensorArrayUnstack/strided_slice"
  op: "StridedSlice"
  input: "forward_roll/scan/TensorArrayUnstack/Shape"
  input: "forward_roll/scan/TensorArrayUnstack/strided_slice/stack"
  input: "forward_roll/scan/TensorArrayUnstack/strided_slice/stack_1"
  input: "forward_roll/scan/TensorArrayUnstack/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "forward_roll/scan/TensorArrayUnstack/range/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "forward_roll/scan/TensorArrayUnstack/range/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "forward_roll/scan/TensorArrayUnstack/range"
  op: "Range"
  input: "forward_roll/scan/TensorArrayUnstack/range/start"
  input: "forward_roll/scan/TensorArrayUnstack/strided_slice"
  input: "forward_roll/scan/TensorArrayUnstack/range/delta"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "forward_roll/scan/TensorArrayUnstack/TensorArrayScatter/TensorArrayScatterV3"
  op: "TensorArrayScatterV3"
  input: "forward_roll/scan/TensorArray"
  input: "forward_roll/scan/TensorArrayUnstack/range"
  input: "placeholders/input_data"
  input: "forward_roll/scan/TensorArray:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@placeholders/input_data"
      }
    }
  }
}
node {
  name: "forward_roll/scan/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "forward_roll/scan/TensorArray_1/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 17
      }
    }
  }
}
node {
  name: "forward_roll/scan/TensorArray_1"
  op: "TensorArrayV3"
  input: "forward_roll/scan/TensorArray_1/size"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 24
        }
      }
    }
  }
  attr {
    key: "identical_element_shapes"
    value {
      b: true
    }
  }
  attr {
    key: "tensor_array_name"
    value {
      s: ""
    }
  }
}
node {
  name: "forward_roll/scan/while/maximum_iterations"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 17
      }
    }
  }
}
node {
  name: "forward_roll/scan/while/iteration_counter"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "forward_roll/scan/while/Enter"
  op: "Enter"
  input: "forward_roll/scan/while/iteration_counter"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "forward_roll/scan/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: false
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 10
    }
  }
}
node {
  name: "forward_roll/scan/while/Enter_1"
  op: "Enter"
  input: "forward_roll/scan/Const"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "forward_roll/scan/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: false
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 10
    }
  }
}
node {
  name: "forward_roll/scan/while/Enter_2"
  op: "Enter"
  input: "placeholders/initial_states"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "forward_roll/scan/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: false
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 10
    }
  }
}
node {
  name: "forward_roll/scan/while/Enter_3"
  op: "Enter"
  input: "forward_roll/scan/TensorArray_1:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "forward_roll/scan/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: false
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 10
    }
  }
}
node {
  name: "forward_roll/scan/while/Merge"
  op: "Merge"
  input: "forward_roll/scan/while/Enter"
  input: "forward_roll/scan/while/NextIteration"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "forward_roll/scan/while/Merge_1"
  op: "Merge"
  input: "forward_roll/scan/while/Enter_1"
  input: "forward_roll/scan/while/NextIteration_1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "forward_roll/scan/while/Merge_2"
  op: "Merge"
  input: "forward_roll/scan/while/Enter_2"
  input: "forward_roll/scan/while/NextIteration_2"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "forward_roll/scan/while/Merge_3"
  op: "Merge"
  input: "forward_roll/scan/while/Enter_3"
  input: "forward_roll/scan/while/NextIteration_3"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "forward_roll/scan/while/Less"
  op: "Less"
  input: "forward_roll/scan/while/Merge"
  input: "forward_roll/scan/while/Less/Enter"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "forward_roll/scan/while/Less/Enter"
  op: "Enter"
  input: "forward_roll/scan/while/maximum_iterations"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "forward_roll/scan/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: true
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 10
    }
  }
}
node {
  name: "forward_roll/scan/while/Less_1/y"
  op: "Const"
  input: "^forward_roll/scan/while/Merge"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 17
      }
    }
  }
}
node {
  name: "forward_roll/scan/while/Less_1"
  op: "Less"
  input: "forward_roll/scan/while/Merge_1"
  input: "forward_roll/scan/while/Less_1/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "forward_roll/scan/while/LogicalAnd"
  op: "LogicalAnd"
  input: "forward_roll/scan/while/Less"
  input: "forward_roll/scan/while/Less_1"
}
node {
  name: "forward_roll/scan/while/LoopCond"
  op: "LoopCond"
  input: "forward_roll/scan/while/LogicalAnd"
}
node {
  name: "forward_roll/scan/while/Switch"
  op: "Switch"
  input: "forward_roll/scan/while/Merge"
  input: "forward_roll/scan/while/LoopCond"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@forward_roll/scan/while/Merge"
      }
    }
  }
}
node {
  name: "forward_roll/scan/while/Switch_1"
  op: "Switch"
  input: "forward_roll/scan/while/Merge_1"
  input: "forward_roll/scan/while/LoopCond"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@forward_roll/scan/while/Merge_1"
      }
    }
  }
}
node {
  name: "forward_roll/scan/while/Switch_2"
  op: "Switch"
  input: "forward_roll/scan/while/Merge_2"
  input: "forward_roll/scan/while/LoopCond"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@forward_roll/scan/while/Merge_2"
      }
    }
  }
}
node {
  name: "forward_roll/scan/while/Switch_3"
  op: "Switch"
  input: "forward_roll/scan/while/Merge_3"
  input: "forward_roll/scan/while/LoopCond"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@forward_roll/scan/while/Merge_3"
      }
    }
  }
}
node {
  name: "forward_roll/scan/while/Identity"
  op: "Identity"
  input: "forward_roll/scan/while/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "forward_roll/scan/while/Identity_1"
  op: "Identity"
  input: "forward_roll/scan/while/Switch_1:1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "forward_roll/scan/while/Identity_2"
  op: "Identity"
  input: "forward_roll/scan/while/Switch_2:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "forward_roll/scan/while/Identity_3"
  op: "Identity"
  input: "forward_roll/scan/while/Switch_3:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "forward_roll/scan/while/add/y"
  op: "Const"
  input: "^forward_roll/scan/while/Identity"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "forward_roll/scan/while/add"
  op: "Add"
  input: "forward_roll/scan/while/Identity"
  input: "forward_roll/scan/while/add/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "forward_roll/scan/while/TensorArrayReadV3"
  op: "TensorArrayReadV3"
  input: "forward_roll/scan/while/TensorArrayReadV3/Enter"
  input: "forward_roll/scan/while/Identity_1"
  input: "forward_roll/scan/while/TensorArrayReadV3/Enter_1"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "forward_roll/scan/while/TensorArrayReadV3/Enter"
  op: "Enter"
  input: "forward_roll/scan/TensorArray"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "forward_roll/scan/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: true
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 10
    }
  }
}
node {
  name: "forward_roll/scan/while/TensorArrayReadV3/Enter_1"
  op: "Enter"
  input: "forward_roll/scan/TensorArrayUnstack/TensorArrayScatter/TensorArrayScatterV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "forward_roll/scan/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: true
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 10
    }
  }
}
node {
  name: "forward_roll/scan/while/To_insertion_and_IF_gates/process_rail_concat/axis"
  op: "Const"
  input: "^forward_roll/scan/while/Identity"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "forward_roll/scan/while/To_insertion_and_IF_gates/process_rail_concat"
  op: "ConcatV2"
  input: "forward_roll/scan/while/TensorArrayReadV3"
  input: "forward_roll/scan/while/Identity_2"
  input: "forward_roll/scan/while/To_insertion_and_IF_gates/process_rail_concat/axis"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "forward_roll/scan/while/To_insertion_and_IF_gates/matmul_insert"
  op: "MatMul"
  input: "forward_roll/scan/while/To_insertion_and_IF_gates/process_rail_concat"
  input: "forward_roll/scan/while/To_insertion_and_IF_gates/matmul_insert/Enter"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "forward_roll/scan/while/To_insertion_and_IF_gates/matmul_insert/Enter"
  op: "Enter"
  input: "weights_and_biases/insertion_weight/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "forward_roll/scan/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: true
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 10
    }
  }
}
node {
  name: "forward_roll/scan/while/To_insertion_and_IF_gates/bias_add_insert"
  op: "Add"
  input: "forward_roll/scan/while/To_insertion_and_IF_gates/matmul_insert"
  input: "forward_roll/scan/while/To_insertion_and_IF_gates/bias_add_insert/Enter"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "forward_roll/scan/while/To_insertion_and_IF_gates/bias_add_insert/Enter"
  op: "Enter"
  input: "weights_and_biases/insertion_bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "forward_roll/scan/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: true
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 10
    }
  }
}
node {
  name: "forward_roll/scan/while/To_insertion_and_IF_gates/matmul_IF"
  op: "MatMul"
  input: "forward_roll/scan/while/To_insertion_and_IF_gates/process_rail_concat"
  input: "forward_roll/scan/while/To_insertion_and_IF_gates/matmul_IF/Enter"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "forward_roll/scan/while/To_insertion_and_IF_gates/matmul_IF/Enter"
  op: "Enter"
  input: "weights_and_biases/Input_Forget_weight/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "forward_roll/scan/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: true
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 10
    }
  }
}
node {
  name: "forward_roll/scan/while/To_insertion_and_IF_gates/bias_add_IF"
  op: "Add"
  input: "forward_roll/scan/while/To_insertion_and_IF_gates/matmul_IF"
  input: "forward_roll/scan/while/To_insertion_and_IF_gates/bias_add_IF/Enter"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "forward_roll/scan/while/To_insertion_and_IF_gates/bias_add_IF/Enter"
  op: "Enter"
  input: "weights_and_biases/input_forget_bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "forward_roll/scan/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: true
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 10
    }
  }
}
node {
  name: "forward_roll/scan/while/To_suggestion_gate/sigmoid_insertion_gate"
  op: "Sigmoid"
  input: "forward_roll/scan/while/To_insertion_and_IF_gates/bias_add_insert"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "forward_roll/scan/while/To_suggestion_gate/sigmoid_IF"
  op: "Sigmoid"
  input: "forward_roll/scan/while/To_insertion_and_IF_gates/bias_add_IF"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "forward_roll/scan/while/To_suggestion_gate/scalar"
  op: "Const"
  input: "^forward_roll/scan/while/Identity"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -1.0
      }
    }
  }
}
node {
  name: "forward_roll/scan/while/To_suggestion_gate/mul"
  op: "Mul"
  input: "forward_roll/scan/while/To_suggestion_gate/scalar"
  input: "forward_roll/scan/while/To_suggestion_gate/sigmoid_IF"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "forward_roll/scan/while/To_suggestion_gate/ones"
  op: "Const"
  input: "^forward_roll/scan/while/Identity"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 24
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "forward_roll/scan/while/To_suggestion_gate/making_input_gate"
  op: "Add"
  input: "forward_roll/scan/while/To_suggestion_gate/ones"
  input: "forward_roll/scan/while/To_suggestion_gate/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "forward_roll/scan/while/To_suggestion_rail_and_node/suggestion_rail_making"
  op: "Mul"
  input: "forward_roll/scan/while/To_suggestion_gate/sigmoid_insertion_gate"
  input: "forward_roll/scan/while/Identity_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "forward_roll/scan/while/To_suggestion_rail_and_node/making_suggestion_rail/axis"
  op: "Const"
  input: "^forward_roll/scan/while/Identity"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "forward_roll/scan/while/To_suggestion_rail_and_node/making_suggestion_rail"
  op: "ConcatV2"
  input: "forward_roll/scan/while/TensorArrayReadV3"
  input: "forward_roll/scan/while/To_suggestion_rail_and_node/suggestion_rail_making"
  input: "forward_roll/scan/while/To_suggestion_rail_and_node/making_suggestion_rail/axis"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "forward_roll/scan/while/To_suggestion_rail_and_node/matmul_suggestion"
  op: "MatMul"
  input: "forward_roll/scan/while/To_suggestion_rail_and_node/making_suggestion_rail"
  input: "forward_roll/scan/while/To_suggestion_rail_and_node/matmul_suggestion/Enter"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "forward_roll/scan/while/To_suggestion_rail_and_node/matmul_suggestion/Enter"
  op: "Enter"
  input: "weights_and_biases/Suggestion_weight/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "forward_roll/scan/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: true
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 10
    }
  }
}
node {
  name: "forward_roll/scan/while/To_suggestion_rail_and_node/bias_add_suggestion"
  op: "Add"
  input: "forward_roll/scan/while/To_suggestion_rail_and_node/matmul_suggestion"
  input: "forward_roll/scan/while/To_suggestion_rail_and_node/bias_add_suggestion/Enter"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "forward_roll/scan/while/To_suggestion_rail_and_node/bias_add_suggestion/Enter"
  op: "Enter"
  input: "weights_and_biases/suggestion_bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "forward_roll/scan/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: true
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 10
    }
  }
}
node {
  name: "forward_roll/scan/while/To_suggestion_rail_and_node/tanh_suggestion"
  op: "Tanh"
  input: "forward_roll/scan/while/To_suggestion_rail_and_node/bias_add_suggestion"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "forward_roll/scan/while/To_end/to_suggestion_node"
  op: "Mul"
  input: "forward_roll/scan/while/To_suggestion_rail_and_node/tanh_suggestion"
  input: "forward_roll/scan/while/To_suggestion_gate/making_input_gate"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "forward_roll/scan/while/To_end/forget_gating"
  op: "Mul"
  input: "forward_roll/scan/while/To_suggestion_gate/sigmoid_IF"
  input: "forward_roll/scan/while/Identity_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "forward_roll/scan/while/To_end/suggestion_adding"
  op: "Add"
  input: "forward_roll/scan/while/To_end/forget_gating"
  input: "forward_roll/scan/while/To_end/to_suggestion_node"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "forward_roll/scan/while/TensorArrayWrite/TensorArrayWriteV3"
  op: "TensorArrayWriteV3"
  input: "forward_roll/scan/while/TensorArrayWrite/TensorArrayWriteV3/Enter"
  input: "forward_roll/scan/while/Identity_1"
  input: "forward_roll/scan/while/To_end/suggestion_adding"
  input: "forward_roll/scan/while/Identity_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@forward_roll/scan/while/To_end/suggestion_adding"
      }
    }
  }
}
node {
  name: "forward_roll/scan/while/TensorArrayWrite/TensorArrayWriteV3/Enter"
  op: "Enter"
  input: "forward_roll/scan/TensorArray_1"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@forward_roll/scan/while/To_end/suggestion_adding"
      }
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "forward_roll/scan/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: true
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 10
    }
  }
}
node {
  name: "forward_roll/scan/while/add_1/y"
  op: "Const"
  input: "^forward_roll/scan/while/Identity"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "forward_roll/scan/while/add_1"
  op: "Add"
  input: "forward_roll/scan/while/Identity_1"
  input: "forward_roll/scan/while/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "forward_roll/scan/while/NextIteration"
  op: "NextIteration"
  input: "forward_roll/scan/while/add"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "forward_roll/scan/while/NextIteration_1"
  op: "NextIteration"
  input: "forward_roll/scan/while/add_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "forward_roll/scan/while/NextIteration_2"
  op: "NextIteration"
  input: "forward_roll/scan/while/To_end/suggestion_adding"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "forward_roll/scan/while/NextIteration_3"
  op: "NextIteration"
  input: "forward_roll/scan/while/TensorArrayWrite/TensorArrayWriteV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "forward_roll/scan/while/Exit"
  op: "Exit"
  input: "forward_roll/scan/while/Switch"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "forward_roll/scan/while/Exit_1"
  op: "Exit"
  input: "forward_roll/scan/while/Switch_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "forward_roll/scan/while/Exit_2"
  op: "Exit"
  input: "forward_roll/scan/while/Switch_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "forward_roll/scan/while/Exit_3"
  op: "Exit"
  input: "forward_roll/scan/while/Switch_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "forward_roll/scan/TensorArrayStack/TensorArraySizeV3"
  op: "TensorArraySizeV3"
  input: "forward_roll/scan/TensorArray_1"
  input: "forward_roll/scan/while/Exit_3"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@forward_roll/scan/TensorArray_1"
      }
    }
  }
}
node {
  name: "forward_roll/scan/TensorArrayStack/range/start"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@forward_roll/scan/TensorArray_1"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "forward_roll/scan/TensorArrayStack/range/delta"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@forward_roll/scan/TensorArray_1"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "forward_roll/scan/TensorArrayStack/range"
  op: "Range"
  input: "forward_roll/scan/TensorArrayStack/range/start"
  input: "forward_roll/scan/TensorArrayStack/TensorArraySizeV3"
  input: "forward_roll/scan/TensorArrayStack/range/delta"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@forward_roll/scan/TensorArray_1"
      }
    }
  }
}
node {
  name: "forward_roll/scan/TensorArrayStack/TensorArrayGatherV3"
  op: "TensorArrayGatherV3"
  input: "forward_roll/scan/TensorArray_1"
  input: "forward_roll/scan/TensorArrayStack/range"
  input: "forward_roll/scan/while/Exit_3"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@forward_roll/scan/TensorArray_1"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 24
        }
      }
    }
  }
}
node {
  name: "forward_roll/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
